app/controllers/games_controller.rb

  def planning
    @games = Game.where(status_id: "1")
---
SELECT "games".* FROM "games" WHERE "games"."status_id" = $1  [["status_id", 1]]

  def playing
    @games = Game.where(status_id: "2")
---
SELECT "games".* FROM "games" WHERE "games"."status_id" = $1  [["status_id", 2]]

  def completed
    @games = Game.where(status_id: "3")
---
SELECT "games".* FROM "games" WHERE "games"."status_id" = $1  [["status_id", 3]]

  def dropped
    @games = Game.where(status_id: "4")
---
SELECT "games".* FROM "games" WHERE "games"."status_id" = $1  [["status_id", 4]]

  def show
    begin
    @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    begin
      @game = Game.new(game_params)
      @game.save
      @all_games = Game.order(:id)
---
INSERT INTO "games" ("gamename", "summary", "rating", "imageurl", "status_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "games".* FROM "games" ORDER BY "games"."id" ASC

  def update
    begin
      @game = Game.find(params[:id])
      @game.update(game_params)
      @all_games = Game.order(:id)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "games" SET "status_id" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["status_id", 4], ["updated_at", "2017-06-18 22:11:29.210661"], ["id", 1]]
SELECT "games".* FROM "games" ORDER BY "games"."id" ASC

  def destroy
    begin
      @game = Game.find(params[:id])
      @game.destroy
      @all_games = Game.order(:id)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 8]]
SELECT "games".* FROM "games" ORDER BY "games"."id" ASC